

# ---------------------------------------------------
# 点滅アニメーション
# ---------------------------------------------------
class Blink
  
  
  # -----------------------------------------------
  # コンストラクタ
  # -----------------------------------------------
  constructor: ->
    
    @_flg = false;
    @_cnt = 0;
    @_interval = 0;
    @_num = 0;
    @_delay = 0;
    
    @_isStart = false;
  
  
  
  # -----------------------------------
  # セット
  # -----------------------------------
  set: (interval, num, delay) ->
    
    if !interval? then interval = 1;
    if !num? then num = 1;
    if !delay? then delay = 0;
    
    @_flg = false;
    @_cnt = 0;
    @_num = num;
    @_interval = interval;
    @_delay = delay;
    @_isStart = false;
    
    return @;
  
  
  
  # -----------------------------------
  # 開始
  # -----------------------------------
  start: ->
    
    @_isStart = true;
    
    return @;
  
  
  
  # -----------------------------------
  # 更新
  # -----------------------------------
  update: =>
    
    if @_isStart
      if --@_delay < 0
        if ++@_cnt >= @_interval
          @_cnt = 0;
          @_flg = !@_flg;
          @_num--;
    
    return @;
  
  
  
  # -----------------------------------
  # フラグの取得
  # -----------------------------------
  get: =>
    
    return @_flg;
  
  
  
  # -----------------------------------
  # 点滅が開始されてるかどうか
  # -----------------------------------
  isStart: =>
    
    return (@_delay < 0);
  
  
  
  # -----------------------------------
  # 点滅回数が指定回数を超えてるかどうか
  # -----------------------------------
  isComplete: =>
    
    return (@_num <= 0);
  
  
  
  # -----------------------------------
  # 削除
  # -----------------------------------
  dispose: =>








module.exports = Blink;