Display = require('../libs/display/Display');


# ---------------------------------------------------
# プロジェクト専用Displayクラス
# ---------------------------------------------------
class MyDisplay extends Display
  
  
  # -----------------------------------------------
  # コンストラクタ
  # -----------------------------------------------
  constructor: (option) ->
    
    super(option);
    
    # ステージサイズ
    @_sw = 0;
    @_sh = 0;
   
  
  
  # -----------------------------------------------
  # 初期化
  # -----------------------------------------------
  init: =>
    
    super();
    
    @elm().removeClass("hide");
    
    if (@_option.resize? && @_option.resize) || !@_option.resize?
      MY.resize.add(@_resize);
    
    if (@_option.update? && @_option.update) || !@_option.update?
      MY.update.add(@_update);
  
  
  
  # -----------------------------------------------
  # 破棄
  # -----------------------------------------------
  dispose: =>
    
    MY.resize.remove(@_resize);
    MY.update.remove(@_update);
    
    super();
  
  
  
  # -----------------------------------------------
  # displayオブジェクト作成
  # -----------------------------------------------
  _makeDisplay: (id) =>
    
    d = new Display({
      id:id
    });
    d.init();
    
    return d;
  
  
  
  # -----------------------------------------------
  # 解像度に合わせたpx取得
  # -----------------------------------------------
  p: (val) =>
    
    return MY.f.p(val);
  
  
  
  # ------------------------------------
  # 値をPC、SPで場合分け
  # ------------------------------------
  v2: (pc, sp) =>
    
    return MY.f.v2(pc, sp);
  
  
  
  # -----------------------------------------------
  # 更新
  # -----------------------------------------------
  _update: =>
  
  
  
  # -----------------------------------------------
  # リサイズ
  # -----------------------------------------------
  _resize: (w, h) =>
    
    # ステージサイズ
    @_sw = w || MY.resize.sw();
    @_sh = h || MY.resize.sh();











module.exports = MyDisplay;